I'm also similarly experiencing plan noise on a variety of attributes. An excerpt from a recent plan is below (we changed none of those settings).

```bash
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.render.render_web_service.<REDACTED> will be updated in-place
  ~ resource "render_web_service" "<REDACTED>" {
      ~ active_custom_domains         = [
          - {
              <REDACTED>
            },
        ] -> (known after apply)
      + log_stream_override           = (known after apply)
      + max_shutdown_delay_seconds    = (known after apply)
        name                          = "<REDACTED>"
      ~ notification_override         = {
          ~ notifications_to_send         = "default" -> (known after apply)
          ~ preview_notifications_enabled = "default" -> (known after apply)
        } -> (known after apply)
      ~ pull_request_previews_enabled = false -> (known after apply)
      ~ runtime_source                = {
          ~ docker = {
              ~ auto_deploy_trigger = "off" -> (known after apply)
                # (5 unchanged attributes hidden)
            }
        }
      ~ slug                          = "<REDACTED>" -> (known after apply)
        # (10 unchanged attributes hidden)
    }
```